#include <iostream>
#include <stdio.h>
#include <time.h>
#include "windows.h"
#include "MyClass.h"
using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	cout << "Задание: Требуется реализовать структуру данных\n«ассоциативный массив», используя связный список." << endl;
	cout << "------------------------------------------------------------------------------------------------------" << endl;
	MyClass mC;

	int key = 0;
	string name;

	for (int i = 0; i < 2; i++) {
		cout << "Введите номер студента: ";
		key = 0;
		cin >> key;

		cout << "Введите фамилию студента: ";
		cin >> name;

		mC.add_to_list(key, name);
	}

	cout << "------------------------------------------------------------------------------------------------------ " << endl;
	mC.output_list();

	
	//лабораторная работа №5
	cout << "------------------------------------------------------------------------------------------------------" << endl;
	mC.input_in_file();
	cout << "Список записан в файл" << endl;
	cout << "------------------------------------------------------------------------------------------------------" << endl;
	mC.output_from_file(); 


	system("pause");
	return 0;
}