#include <iostream>
#include <stdio.h>
#include <time.h>
#include "windows.h"
#include "MyClass.h"
using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	cout << "Задание: Требуется реализовать структуру данных\n«ассоциативный массив», используя связный список." << endl;
	cout << "------------------------------------------------------------------------------------------------------" << endl;
	MyClass mC;

	int key = 0;
	string name;

	for (int i = 0; i < 4; i++) {
		cout << "Введите номер студента: ";
	    key = 0;
		cin >> key;

		cout << "Введите фамилию студента: ";
		cin >> name;

		mC.add_to_list(key, name);
	}

	cout << "------------------------------------------------------------------------------------------------------ "<< endl;
	mC.output_list();

	cout << "------------------------------------------------------------------------------------------------------" << endl;
	cout << "Введите номер студента, которого хотите найти: ";
	key = 0;
	cin >> key;
	cout << "Фамилия найденного студента: ";
	mC.find_student(key);

	cout << "------------------------------------------------------------------------------------------------------" << endl;
	cout << "Введите номер студента, которого хотите удалить: ";
	key = 0;
	cin >> key;
	mC.delete_student(key);
	cout << "------------------------------------------------------------------------------------------------------" << endl;
	mC.output_list();

	system("pause");
	return 0;
}


